# ЗАГАЛЬНІ:
# Створити віджет діалогу для питань - так/ні

# Вікно ГОЛОВНЕ:
# - Виписати список колонок вхідних файлів
# - Додати модель представлення даних вхідних файлів
# - Вирішити чи додавати делегатів (колір залежно від ненормальних значень)
# - додати рамку вікна обрання типової папки імпорту (драг та кнопки управління вікном, тайтл)
# - підключити кнопку виходу та додати вікно підтвердження виходу
# - підключити кнопку повної очистки з вікном попередження


# Вікно налаштувань:
# - Додати рамку з драгом та кнопками управління віна Віндоус
# - Додати вікно попередження про скидання до заводських налаштувань
# - Додати вікно попередження про завантаження налаштувань з файлу
# - Вирішити, чи поєднувати колонки та типи до одного табу через випадаючі списки
#
# Налаштування типів:
# - додати правильне зняття виділення зі списків типів при натисканні на порожню ділянку
# - додати можливість виділення та копіювання запису (але заборонити редагування) - список для розпізнання
#
# Налаштування колонок:
# - підготувати випадаючий список зі вхідними типами
# - підготувати оновлення списку розпізнання залежно від обраного випадаючого списку (елементу)

# ФАЙЛ ДОПОМОГИ:
# - визначити спосіб (відкриття файлу, чи краще скористатись конструктором Qt)
# - створити структуру розділів для вступ
# - описати роботу конвертеру - принцип, послідовність, кнопки
# - описати роботу налаштувань
