# ЗАГАЛЬНІ:
# Створити віджет діалогу для питань - так/ні

# Вікно ГОЛОВНЕ:
# - Виписати список колонок вхідних файлів
# - Додати модель представлення даних вхідних файлів
# - Вирішити чи додавати делегатів (колір залежно від ненормальних значень)
# - додати рамку вікна обрання типової папки імпорту (драг та кнопки управління вікном, тайтл)
# - підключити кнопку виходу та додати вікно підтвердження виходу
# - підключити кнопку повної очистки з вікном попередження

# Стиль :
# - СПЛЕШ-вікно додати
# - перевірити альтернативні іконки (розділи, службові кнопки, типові роботи з папками)
# - застосувати шрифт з сайту
# - зменшити висоту тайтлу головного вікна


# Вікно налаштувань:
# - Додати рамку з драгом та кнопками управління віна Віндоус
# - Додати вікно попередження про скидання до заводських налаштувань
# - Додати вікно попередження про завантаження налаштувань з файлу
# - Вирішити, чи поєднувати колонки та типи до одного табу через випадаючі списки
# !- заборонити редагування списку типів безпосередньо з віджету
#
# Налаштування типів:
# - додати правильне зняття виділення зі списків типів при натисканні на порожню ділянку
# - додати можливість виділення та копіювання запису (але заборонити редагування) - список для розпізнання
#
# Налаштування колонок:
# - підготувати випадаючий список зі вхідними типами
# - підготувати оновлення списку розпізнання залежно від обраного випадаючого списку (елементу)

# ФАЙЛ ДОПОМОГИ:
# - визначити спосіб (відкриття файлу, чи краще скористатись конструктором Qt)
# - створити структуру розділів для вступ
# - описати роботу конвертеру - принцип, послідовність, кнопки
# - описати роботу налаштувань

# АЛГОРИТМ КОНВЕРТЕРУ:
# - додати функцію опрацювання потрійного запису Київстар - Абонент - Абонент - Переадресація
# - адаптувати завантаження з *.тхт файлів (та інших суміжних)
# - пошук по всім сторінкам ексель таблиці
# - помилка конвертеру - не підшиває всі БС з довідника (можливо через початковий 0 у вхідному файлі)

# ДЛЯ ПОДАЛЬШИХ НАПРАЦЮВАНЬ:
#  - розшифрувати словник ІМЕІ - модель;
#  - спарсити БД БС - Варан




# МОДЕЛЬ СПИСКУ ФАЙЛІВ ДЛЯ ОПРАЦЮВАННЯ:
# 0 - шлях з іменем файлу та розширенням
# 1 - назва файлу
# 2 - розмір файлу
# 3 - відбиток файлу
# 4 - кількість записів у вхідному файлі
# 5 - кількість придатних записів
# 6 - кількість колонок виявлених
# 7 - кількість колонок розпізнаних
# 8 - кількість типів виявлених
# 9 - кількість типів розпізнаних
# 10 - кількість унікальних абонентів А
# 11 - кількість унікальних абонентів Б
# 12 - кількість ІМЕІ А
# 13 - кількість ІМЕІ Б
# 14 - кількість територіальних зон ЛАК
# 15 - кількість унікальних антен (ЛАК/СІД)
# 16 - кількість унікальних антен, що мають відомості про адресу та азимут
# 17 - необхідність визначення абонента Б (лайф - А, що здійснює + А, що приймає)
# 18 - необхідність визначення абонента Б (кс - А, що здійнює + А переадресації)
# 19 - необхідність підключення довідників БС
# 20 - Визначений тип
# 21 - список ключових абонентів
# 21 - Лог для відображення ходу конвертування

# МОДЕЛЬ ВІДОБРАЖЕННЯ СПИСКУ ФАЙЛІВ В ТАБЛИЦІ КОНВЕРТЕРУ
# 0 - назва файлу з розширенням (1)
# 1 - розмір файлу (2)
# 2 - кількість записів виявлених/підготовлених (4/5)
# 3 - кількість колонок виявлених/розпізнаних (6/7)
# 4 - кількість виявлени/розпізнаних типів (8/9)
# 5 - унікальні абоненти А-Б (10/11)
# 6 - кількість ІМЕІ А-Б (12/13)
# 7 - кількість ЛАК (14)
# 8 - Кількість БС всього/з підписами (15/16)
# 9 - визначений тип (20)




